Micro-Digital/SecureSMX/BSP/ARM/LPC55Sxx/NXP/drivers/fsl_prince.c
        /* Make sure PUF is started to allow key and IV code decryption and generation */
        if (true != PUF_IsGetKeyAllowed(PUF))
        {
            return status;
        }

        /* Generate new IV code for the PRINCE region */
        status =
            PUF_SetIntrinsicKey(PUF, (puf_key_index_register_t)(kPUF_KeyIndex_02 + (puf_key_index_register_t)region), 8,
                                &prince_iv_code[0], FLASH_FFR_IV_CODE_SIZE);
        if ((kStatus_Success == status) && (true == store))
        {
            /* Store the new IV code for the PRINCE region into the respective FFRs. */
            /* Create a new version of "Customer Field Programmable" (CFP) page. */
            if (kStatus_FLASH_Success ==
                FFR_GetCustomerInfieldData(flash_context, (uint8_t *)tempBuffer, 0, FLASH_FFR_MAX_PAGE_SIZE))
            {
                /* Set the IV code in the page */
                memcpy(&tempBuffer[offsetof(cfpa_cfg_info_t, ivCodePrinceRegion) +
                                   ((region * sizeof(cfpa_cfg_iv_code_t))) + 4],
                       &prince_iv_code[0], FLASH_FFR_IV_CODE_SIZE);

                uint32_t *p32    = (uint32_t *)tempBuffer;
                uint32_t version = p32[1];
                if (version == 0xFFFFFFFFu)
                {
                    return kStatus_Fail;
                }
                version++;
                p32[1] = version;

                /* Program the page and enable firewall for "Customer field area" */
                if (kStatus_FLASH_Success ==
                    FFR_InfieldPageWrite(flash_context, (uint8_t *)tempBuffer, FLASH_FFR_MAX_PAGE_SIZE))
                {
                    status = kStatus_Success;
                }
                else
                {
                    status = kStatus_Fail;
                }
            }
        }
        if (status == kStatus_Success)
        {
            /* Pass the new IV code */
            memcpy(iv_code, &prince_iv_code[0], FLASH_FFR_IV_CODE_SIZE);
        }
        return status;
    }
    else
    {
        return status;
    }
}

/*!
 * @brief Load IV code.
 *
 * This function enables IV code loading into the PRINCE bus encryption engine.
 * This function is implemented as a wrapper of the exported ROM bootloader API.
 *
 * @param region PRINCE region index.
 * @param iv_code IV code pointer used for passing the IV code.
 *
 * @return kStatus_Success upon success
 * @return kStatus_Fail    otherwise
 */
status_t PRINCE_LoadIV(prince_region_t region, uint8_t *iv_code)
{
    status_t status = kStatus_Fail;
    /* Check the silicone version */
    if (0x1 == Chip_GetVersion())
    {
        /* Implementation for the A1 version chip */
        s_busCryptoEngineInterface = (const bus_crypto_engine_interface_t *)(*(uint32_t **)0x13000020)[9];

        status = s_busCryptoEngineInterface->bus_crypto_engine_load_iv((uint32_t)region, &iv_code[0]);

        if (kStatus_SKBOOT_Success == status)
        {
            return kStatus_Success;
        }
        else
        {
            return kStatus_Fail;
        }
    }
    else if (0x0 == Chip_GetVersion())
    {
        /* Implementation for the A0 version chip */
        uint32_t keyIndex    = 0x0Fu & iv_code[1];
        uint8_t prince_iv[8] = {0};

        /* Make sure PUF is started to allow key and IV code decryption and generation */
        if (true != PUF_IsGetKeyAllowed(PUF))
        {
            return status;
        }

        /* Check if region number matches the PUF index value */
        if ((kPUF_KeyIndex_02 + (puf_key_index_register_t)region) == (puf_key_index_register_t)keyIndex)
        {
            /* Decrypt the IV */
            if (kStatus_Success == PUF_GetKey(PUF, iv_code, FLASH_FFR_IV_CODE_SIZE, &prince_iv[0], 8))
            {
                /* Store the new IV for the PRINCE region into PRINCE registers. */
                PRINCE_SetRegionIV(PRINCE, (prince_region_t)region, prince_iv);
                status = kStatus_Success;
            }
        }
        return status;
    }
    else
    {
        return status;
    }
}

/*!
 * @brief Allow encryption/decryption for specified address range.
 *
 * This function sets the encryption/decryption for specified address range.
 * This function is implemented as a wrapper of the exported ROM bootloader API.
 * Ensure about 800 bytes free space on the stack when calling this routine!
 *
 * @param region PRINCE region index.
 * @param start_address start address of the area to be encrypted/decrypted.
 * @param length length of the area to be encrypted/decrypted.
 * param flash_context pointer to the flash driver context structure.
 *
 * @return kStatus_Success upon success
 * @return kStatus_Fail    otherwise
 */
status_t PRINCE_SetEncryptForAddressRange(prince_region_t region,
                                          uint32_t start_address,
                                          uint32_t length,
                                          flash_config_t *flash_context)
{
    status_t status = kStatus_Fail;
    /* Check the silicone version */
    if (0x1 == Chip_GetVersion())
    {
        /* Implementation for the A1 version chip */
        s_busCryptoEngineInterface = (const bus_crypto_engine_interface_t *)(*(uint32_t **)0x13000020)[9];

        status = s_busCryptoEngineInterface->bus_crypto_engine_set_encrypt_for_address_range(
            (uint8_t)region, start_address, length, flash_context);

        if (kStatus_SKBOOT_Success == status)
        {
            return kStatus_Success;
        }
        else
        {
            return kStatus_Fail;
        }
    }
    else if (0x0 == Chip_GetVersion())
    {
        /* Implementation for the A0 version chip */
        uint32_t srEnableRegister = 0;
        uint32_t alignedStartAddress;
        uint32_t end_address                = start_address + length;
        uint32_t prince_region_base_address = 0;
        uint8_t my_prince_iv_code[52]       = {0};
        uint8_t tempBuffer[512]             = {0};
        uint32_t prince_base_addr_ffr_word  = 0;

