Micro-Digital/SecureSMX/BSP/ARM/LPC55Sxx/NXP/drivers/fsl_prince.c
        /* Check the address range, regions overlaping. */
        if ((start_address > 0xA0000) || ((start_address < 0x40000) && (end_address > 0x40000)) ||
            ((start_address < 0x80000) && (end_address > 0x80000)) ||
            ((start_address < 0xA0000) && (end_address > 0xA0000)))
        {
            return kStatus_Fail;
        }

        /* Generate new IV code for the PRINCE region and store the new IV into the respective FFRs */
        status = PRINCE_GenNewIV((prince_region_t)region, &my_prince_iv_code[0], true, flash_context);
        if (kStatus_Success != status)
        {
            return kStatus_Fail;
        }

        /* Store the new IV for the PRINCE region into PRINCE registers. */
        status = PRINCE_LoadIV((prince_region_t)region, &my_prince_iv_code[0]);
        if (kStatus_Success != status)
        {
            return kStatus_Fail;
        }

        alignedStartAddress = ALIGN_DOWN(start_address, FSL_PRINCE_DRIVER_SUBREGION_SIZE_IN_KB * 1024);

        uint32_t subregion = alignedStartAddress / (FSL_PRINCE_DRIVER_SUBREGION_SIZE_IN_KB * 1024);
        if (subregion < (32))
        {
            /* PRINCE_Region0 */
            prince_region_base_address = 0;
        }
        else if (subregion < (64))
        {
            /* PRINCE_Region1 */
            subregion                  = subregion - 32;
            prince_region_base_address = 0x40000;
        }
        else
        {
            /* PRINCE_Region2 */
            subregion                  = subregion - 64;
            prince_region_base_address = 0x80000;
        }

        srEnableRegister = (1 << subregion);
        alignedStartAddress += (FSL_PRINCE_DRIVER_SUBREGION_SIZE_IN_KB * 1024);

        while (alignedStartAddress < (start_address + length))
        {
            subregion++;
            srEnableRegister |= (1 << subregion);
            alignedStartAddress += (FSL_PRINCE_DRIVER_SUBREGION_SIZE_IN_KB * 1024);
        }

        /* Store BASE_ADDR into PRINCE register before storing the SR to avoid en/decryption triggering
           from addresses being defined by current BASE_ADDR register content (could be 0 and the decryption
           of actually executed code can be started causing the hardfault then). */
        status = PRINCE_SetRegionBaseAddress(PRINCE, (prince_region_t)region, prince_region_base_address);
        if (kStatus_Success != status)
        {
            return status;
        }

        /* Store SR into PRINCE register */
        status = PRINCE_SetRegionSREnable(PRINCE, (prince_region_t)region, srEnableRegister);
        if (kStatus_Success != status)
        {
            return status;
        }

        /* Store SR and BASE_ADDR into CMPA FFR */
        if (kStatus_Success == FFR_GetCustomerData(flash_context, (uint8_t *)&tempBuffer, 0, FLASH_FFR_MAX_PAGE_SIZE))
        {
            /* Set the PRINCE_SR_X in the page */
            memcpy(&tempBuffer[offsetof(cmpa_cfg_info_t, princeSr) + (region * sizeof(uint32_t))], &srEnableRegister,
                   sizeof(uint32_t));

            /* Set the ADDRX_PRG in the page */
            memcpy(&prince_base_addr_ffr_word, &tempBuffer[offsetof(cmpa_cfg_info_t, princeBaseAddr)],
                   sizeof(uint32_t));
            prince_base_addr_ffr_word &= ~((FLASH_CMPA_PRINCE_BASE_ADDR_ADDR0_PRG_MASK) << (region * 4));
            prince_base_addr_ffr_word |=
                (((prince_region_base_address >> 18) & FLASH_CMPA_PRINCE_BASE_ADDR_ADDR0_PRG_MASK) << (region * 4));
            memcpy(&tempBuffer[offsetof(cmpa_cfg_info_t, princeBaseAddr)], &prince_base_addr_ffr_word,
                   sizeof(uint32_t));

            /* Program the CMPA page, set seal_part parameter to false (used during development to avoid sealing the
             * part)
             */
            status = FFR_CustFactoryPageWrite(flash_context, (uint8_t *)tempBuffer, false);
        }

        return status;
    }
    else
    {
        return status;
    }
}

/*!
 * @brief Gets the PRINCE Sub-Region Enable register.
 *
 * This function gets PRINCE SR_ENABLE register.
 *
 * @param base PRINCE peripheral address.
 * @param region PRINCE region index.
 * @param sr_enable Sub-Region Enable register pointer.
 *
 * @return kStatus_Success upon success
 * @return kStatus_InvalidArgument
 */
status_t PRINCE_GetRegionSREnable(PRINCE_Type *base, prince_region_t region, uint32_t *sr_enable)
{
    status_t status = kStatus_Success;

    switch (region)
    {
        case kPRINCE_Region0:
            *sr_enable = base->SR_ENABLE0;
            break;

        case kPRINCE_Region1:
            *sr_enable = base->SR_ENABLE1;
            break;

        case kPRINCE_Region2:
            *sr_enable = base->SR_ENABLE2;
            break;

        default:
            status = kStatus_InvalidArgument;
            break;
    }

    return status;
}

/*!
 * @brief Gets the PRINCE region base address register.
 *
 * This function gets PRINCE BASE_ADDR register.
 *
 * @param base PRINCE peripheral address.
 * @param region PRINCE region index.
 * @param region_base_addr Region base address pointer.
 *
 * @return kStatus_Success upon success
 * @return kStatus_InvalidArgument
 */
status_t PRINCE_GetRegionBaseAddress(PRINCE_Type *base, prince_region_t region, uint32_t *region_base_addr)
{
    status_t status = kStatus_Success;

    switch (region)
    {
        case kPRINCE_Region0:
            *region_base_addr = base->BASE_ADDR0;
            break;

        case kPRINCE_Region1:
            *region_base_addr = base->BASE_ADDR1;
            break;

        case kPRINCE_Region2:
            *region_base_addr = base->BASE_ADDR2;
            break;

        default:
            status = kStatus_InvalidArgument;
            break;
    }

    return status;
}

/*!
 * @brief Sets the PRINCE region IV.
 *
 * This function sets specified AES IV for the given region.
 *
 * @param base PRINCE peripheral address.
 * @param region Selection of the PRINCE region to be configured.
 * @param iv 64-bit AES IV in little-endian byte order.
 */
status_t PRINCE_SetRegionIV(PRINCE_Type *base, prince_region_t region, const uint8_t iv[8])
{
    status_t status              = kStatus_Fail;
    volatile uint32_t *IVMsb_reg = NULL;
    volatile uint32_t *IVLsb_reg = NULL;

